'use strict';
const emojis = [
  '(´･ω･`)',
  '｜ω・）',
  '(´౪`)',
  '(^q^)',
  '(・∀・)',
  '(・ω・)',
  '（>∀<）',
  '٩◔̯◔۶）',
  'ʕ·ᴥ·ʔ',
  'ʕ•ᴥ•ʔ',
  '(つД・)',
  '(`o´)',
  '(ˇ⊖ˇ)',
  '(°ヮ°)',
  '^ↀᴥↀ^）',
  '(⊙ᗜ⊙)',
  'ʕ⊙ᴥ⊙ʔ',
  '(´﹃｀)',
  '(・ω<)',
  '（◞‸◟）',
  'ʕ　·ᴥ·ʔ',
  'ʕ·ᴥ·　ʔ',
  '(・ε・｀)',
  '<丶｀∀´>',
  '(´д｀、)',
  '(✿ヘᴥヘ)',
  '(‘ω‘ )',
  '(✿╹◡╹)',
  '(▰∀◕)ﾉ',
  '(;´ρ`)',
  '▼・ᴥ・▼',
  'U・♀・U',
  '(❁º◡º❁)',
  '/ᐠ｡ꞈ｡ᐟ\\',
  '( ⓛ ω ⓛ *)',
  'ʕっ˘ڡ˘ςʔ',
  '⊂(￣(ｴ)￣)⊃',
  ' ʕᴥ• ʔ☝',
  'ʅʕ•ᴥ•ʔʃ',
  'ʕ； •`ᴥ•´ʔ',
  '(ᵔᴥᵔ)',
  '(●⌒ｖ⌒●)'
];

module.exports = {
  random() {
    return emojis[Math.floor(Math.random() * emojis.length) % emojis.length];
  }
}
